# YOLOv8 Standard avec adaptations MobileNetV3

nc: 38 # Nombre de classes

scales:
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [64, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [64, True]] # 2
  - [-1, 1, Conv, [128, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [128, True]] # 4
  - [-1, 1, Conv, [256, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [256, True]] # 6
  - [-1, 1, Conv, [512, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [512, True]] # 8
  - [-1, 1, SPPF, [512, 5]] # 9

head:
  # [from, repeats, module, args]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]] # 11
  - [-1, 3, C2f, [256, False]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 4], 1, Concat, [1]] # 14
  - [-1, 3, C2f, [128, False]] # 15-P3/8

  - [-1, 1, Conv, [128, 3, 2]] # 16
  - [[-1, 12], 1, Concat, [1]] # 17
  - [-1, 3, C2f, [256, False]] # 18-P4/16

  - [-1, 1, Conv, [256, 3, 2]] # 19
  - [[-1, 9], 1, Concat, [1]] # 20
  - [-1, 3, C2f, [512, False]] # 21-P5/32

  - [[15, 18, 21], 1, Detect, [nc]] # 22
